---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeTypeRefsWarning
source: html/14d49d5b-f870-7ca9-733b-20a73cfa8f3a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeTypeRefsWarning Property

Cannot create reference objects for a DirectShapeType.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateDirectShapeTypeRefsWarning { get; }
```